[
  {
    "pmid": "27102172",
    "title": "Effects of Resistance Training Frequency on Measures of Muscle Hypertrophy: A Systematic Review and Meta-Analysis",
    "abstract": "A number of resistance training (RT) program variables can be manipulated to maximize muscular hypertrophy. One variable of primary interest in this regard is RT frequency. Frequency can refer to the number of RT sessions performed in a given period of time, as well as the number of times a specific muscle group is trained in a given period. The purpose of this paper was to conduct a systematic review and meta-analysis of randomized controlled trials to determine the effects of RT frequency on muscle hypertrophy.",
    "journal": "Sports Medicine",
    "publication_date": "2016-10-01",
    "authors": ["Schoenfeld BJ", "Ogborn D", "Krieger JW"],
    "keywords": ["Resistance Training", "Muscle Hypertrophy", "Exercise Frequency", "Meta-Analysis"],
    "search_topic": "resistance training muscle hypertrophy",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "28344319",
    "title": "International Society of Sports Nutrition Position Stand: protein and exercise",
    "abstract": "It is the position of the International Society of Sports Nutrition (ISSN) that exercising individuals need approximately 1.4 to 2.0 g protein per kilogram of bodyweight per day. Specific recommendations regarding optimal protein type and timing may provide further benefits to body composition and performance. These recommendations are based upon extensive research examining the role of protein supplementation.",
    "journal": "Journal of the International Society of Sports Nutrition",
    "publication_date": "2017-06-20",
    "authors": ["Jäger R", "Kerksick CM", "Campbell BI"],
    "keywords": ["Protein", "Exercise", "Nutrition", "Muscle Protein Synthesis"],
    "search_topic": "protein supplementation muscle",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "28615996",
    "title": "Creatine supplementation enhances muscular performance during high-intensity resistance exercise",
    "abstract": "Creatine is one of the most popular and widely researched natural supplements. The majority of studies have focused on the effects of creatine monohydrate on performance and health; however, many other forms of creatine exist and are commercially available in the sports nutrition market. Regardless of the form, supplementation with creatine has been shown to increase muscle creatine and phosphocreatine concentrations.",
    "journal": "Journal of Strength and Conditioning Research",
    "publication_date": "2017-07-01",
    "authors": ["Kreider RB", "Kalman DS", "Antonio J"],
    "keywords": ["Creatine", "Muscle Performance", "Supplementation", "High-Intensity Exercise"],
    "search_topic": "creatine supplementation performance",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "30279480",
    "title": "High-Intensity Interval Training and Moderate-Intensity Continuous Training: A Comparative Analysis",
    "abstract": "High-intensity interval training (HIIT) involves repeated bouts of high-intensity effort followed by varied recovery times. This type of training can induce numerous metabolic adaptations that, taken together, result in enhanced performance during exercise that is sustained by oxidative energy metabolism.",
    "journal": "Sports Medicine",
    "publication_date": "2018-10-02",
    "authors": ["MacInnis MJ", "Gibala MJ"],
    "keywords": ["High-Intensity Interval Training", "HIIT", "Cardiovascular Fitness", "Exercise Physiology"],
    "search_topic": "HIIT high intensity interval training",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "26733935",
    "title": "Cardiovascular adaptations to exercise training",
    "abstract": "Regular aerobic exercise training produces numerous cardiovascular adaptations. These include increased maximal oxygen uptake, cardiac output, and stroke volume, as well as reduced heart rate at rest and during submaximal exercise. These adaptations improve exercise capacity and cardiovascular health.",
    "journal": "Comprehensive Physiology",
    "publication_date": "2016-01-01",
    "authors": ["Hellsten Y", "Nyberg M"],
    "keywords": ["Cardiovascular System", "Exercise", "Aerobic Training", "Heart Rate"],
    "search_topic": "cardiovascular exercise fitness",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "29462923",
    "title": "Muscle recovery: using massage as a regeneration strategy",
    "abstract": "Massage is widely used by athletes as a recovery modality after exercise. Research suggests that massage may help reduce muscle soreness, decrease swelling, and improve range of motion following intense exercise. The mechanisms may involve improved blood flow and reduced inflammation.",
    "journal": "Sports Medicine",
    "publication_date": "2018-02-01",
    "authors": ["Poppendieck W", "Wegmann M", "Ferrauti A"],
    "keywords": ["Massage", "Muscle Recovery", "Exercise Recovery", "Sports Therapy"],
    "search_topic": "muscle recovery nutrition",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "31100419",
    "title": "Whey protein supplementation and muscle protein synthesis",
    "abstract": "Whey protein is a popular dietary supplement among athletes and fitness enthusiasts. It contains all essential amino acids and is particularly rich in leucine, which plays a key role in stimulating muscle protein synthesis. Studies show that whey protein consumption after resistance exercise enhances muscle recovery and adaptation.",
    "journal": "Nutrients",
    "publication_date": "2019-05-17",
    "authors": ["Davies RW", "Carson BP", "Jakeman PM"],
    "keywords": ["Whey Protein", "Muscle Protein Synthesis", "Dietary Supplements", "Leucine"],
    "search_topic": "whey protein muscle synthesis",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "28919842",
    "title": "Resistance training is medicine: effects on muscle strength and body composition",
    "abstract": "Resistance training induces substantial improvements in muscle strength, power, and hypertrophy. These adaptations occur through various mechanisms including increased protein synthesis, satellite cell activation, and neural adaptations. Regular resistance training is associated with improved metabolic health, bone density, and functional capacity.",
    "journal": "Current Sports Medicine Reports",
    "publication_date": "2017-09-01",
    "authors": ["Westcott WL"],
    "keywords": ["Resistance Training", "Muscle Strength", "Body Composition", "Health Benefits"],
    "search_topic": "resistance training muscle hypertrophy",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "29315892",
    "title": "Protein timing and its effects on muscular hypertrophy and strength in individuals engaged in resistance training",
    "abstract": "The timing of protein ingestion relative to exercise has been suggested to influence muscle protein synthesis and subsequent adaptations. While the anabolic window concept remains debated, ensuring adequate protein intake throughout the day appears most important for optimizing muscle growth.",
    "journal": "Journal of the International Society of Sports Nutrition",
    "publication_date": "2018-01-09",
    "authors": ["Schoenfeld BJ", "Aragon AA", "Krieger JW"],
    "keywords": ["Protein Timing", "Muscle Hypertrophy", "Anabolic Window", "Nutrition"],
    "search_topic": "protein supplementation muscle",
    "fetched_at": "2025-11-08T14:30:00"
  },
  {
    "pmid": "28852372",
    "title": "Effects of creatine supplementation on cognitive function in healthy individuals",
    "abstract": "Beyond its well-established role in improving exercise performance, creatine supplementation may also enhance cognitive function. The brain requires substantial energy, and creatine helps maintain ATP availability. Studies suggest potential benefits for memory, processing speed, and mental fatigue, particularly during periods of sleep deprivation or cognitive stress.",
    "journal": "Experimental Gerontology",
    "publication_date": "2017-10-01",
    "authors": ["Avgerinos KI", "Spyrou N", "Bougioukas KI"],
    "keywords": ["Creatine", "Cognitive Function", "Brain Health", "Mental Performance"],
    "search_topic": "creatine supplementation performance",
    "fetched_at": "2025-11-08T14:30:00"
  }
]